<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | 后台定义应用设置
    // +----------------------------------------------------------------------

    //视图输出字符串内容替换
    'view_replace_str'      =>[
        '__ADMIN__'  => '/static/admin',
        '__INDEX__'  => '/static/index',
        '__uploads__'  => '/static/uploads',
        '__IMG__'=>'/static/uploads',
    ],

    //分页配置
    'paginate'               => [
        //'type'      => 'bootstrap',
        'type'      => 'Layui',
        'var_page'  => 'page',
        'list_rows' => 15,
    ],
];
